In [1]:
# Import dependencies

# Pandas
import pandas as pd

# SQLAlchemy
from sqlalchemy import create_engine

# Engine info for postgres
from config import (user, password, host, port, database)

In [2]:
# Create engine

engine = create_engine(f'postgresql://{user}:{password}@{host}:{port}/{database}')
conn = engine.connect()

In [3]:
# Read employee table

employee_df = pd.read_sql("SELECT * FROM employees", conn)
employee_df.head()

   employee_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0       473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1       475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2        57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3       421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4       282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [4]:
# Read salary table

salary_df = pd.read_sql("SELECT * FROM salaries", conn)
salary_df.head()

   employee_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228

In [5]:
# Read title table

title_df = pd.read_sql("SELECT * FROM titles", conn)
title_df.rename(columns={"title_id":"emp_title_id"}, inplace=True)
title_df

  emp_title_id               title
0        s0001               Staff
1        s0002        Senior Staff
2        e0001  Assistant Engineer
3        e0002            Engineer
4        e0003     Senior Engineer
5        e0004    Technique Leader
6        m0001             Manager

In [6]:
# Merge dataframes

employee_df = employee_df.merge(salary_df, how="inner", on="employee_no")
employee_df.head()

,employee_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000

In [7]:
employee_df = employee_df.merge(title_df, how="inner", on="emp_title_id")
employee_df.head()

,employee_no,emp_title_id,birth_date,first_name,last_name,sex,hire_date,salary,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,Staff
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,Staff
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,56087,Staff
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,87084,Staff
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,63016,Staff